Revit 2026 API

# MetallicPaintMetallicpaintPearl Property

---

The property labeled "Pearl" from the "MetallicPaint" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string MetallicpaintPearl { get; }
```
```vb
Public Shared ReadOnly Property MetallicpaintPearl As String
	Get
```
```cpp
public:
static property String^ MetallicpaintPearl {
	String^ get ();
}
```
```fsharp
static member MetallicpaintPearl : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MetallicpaintPearlType".

#### Reference

MetallicPaint Class

Autodesk.Revit.DB.Visual Namespace